
/*三羊献瑞

        观察下面的加法算式：

            祥 瑞 生 辉
        +   三 羊 献 瑞
        -------------------
         三 羊 生 瑞 气

        (如果有对齐问题，可以参看【图1.jpg】)
        其中，相同的汉字代表相同的数字，不同的汉字代表不同的数字。
        请你填写“三羊献瑞”所代表的4位数字（答案唯一），不要填写任何多余内容。*/



public class t002 {

    public static void main(String[] args) {
        int a, b, c, d, e, f, g, h;// 分别代表：祥、瑞、生、辉、三、羊、献、气
        int num1 = 0, num2 = 0, num3 = 0;// 分表代表： 祥 瑞 生 辉，三 羊 献 瑞， 三 羊 生 瑞 气
        for (a = 1; a <= 9; a++) {// 首位数字不能为0，所以从1开始
            for (b = 0; b <= 9; b++) {
                for (c = 0; c <= 9; c++) {
                    for (d = 0; d <= 9; d++) {
                        for (e = 1; e <= 9; e++) {// 首位数字不能为0，所以从1开始
                            for (f = 0; f <= 9; f++) {
                                for (g = 0; g <= 9; g++) {
                                    for (h = 0; h <= 9; h++) {
                                        if (a != b && a != c && a != d && a != e && a != f && a != g && a != h && b != c
                                                && b != d && b != e && b != f && b != g && b != h && c != d && c != e
                                                && c != f && c != g && c != h && d != e && d != f && d != g && d != h
                                                && e != f && e != g && e != h && f != g && f != h && g != h) {
                                            num1 = a * 1000 + b * 100 + c * 10 + d;
                                            num2 = e * 1000 + f * 100 + g * 10 + b;
                                            num3 = e * 10000 + f * 1000 + c * 100 + b * 10 + h;
                                            if (num1 + num2 == num3) {
                                                System.out.println(num2);
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }

    }

}
